tap "caskroom/cask"
tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"

brew "git"
brew "carthage"
brew "heroku"
brew "mas"
brew "postgresql"
brew "ruby"
brew "tmux"
brew "vim"
brew "watchman"
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "1password-cli"
cask "artpip"
cask "atom"
cask "cisco-proximity"
cask "deckset"
cask "docker"
cask "dropbox"
cask "gitup"
cask "google-chrome"
cask "postman"
cask "setapp"
cask "sketch"
cask "skype"
cask "slack"
cask "subler"
cask "transmit"

mas "1Password", id: 443987910
mas "Airmail 3", id: 918858936
mas "CARROT Weather - Talking Forecast Robot", id: 993487541
mas "Pixelmator", id: 407963104
mas "Reeder" id: 880001334
mas "The Unarchiver", id: 425424353

# Xcode dependent stuff
mas "Xcode", id: 497799835
brew "swiftlint"

# Java dependent stuff
cask "java"
brew "maven"
